"+ Add" = "+ Lisää";

"Add a card" = "Lisää kortti";

"Add a payment method" = "Lisää maksutapa";

"Add bank account" = "Lisää pankkitili";

"Add new payment method" = "Lisää uusi maksutapa";

"Add your payment information" = "Lisää maksutiedot";

"Approve payment" = "Hyväksy maksu";

"Are you sure you want to remove this card?" = "Haluatko varmasti poistaa tämän kortin?";

"Are you sure you want to remove this linked account?" = "Haluatko varmasti poistaa tämän linkitetyn tilin?";

"Back" = "Takaisin";

"Bank account" = "Pankkitili";

"Buy now or pay later with Klarna." = "Osta nyt tai maksa myöhemmin Klarnalla.";

"Buy using a UPI ID" = "Osta käyttämällä UPI-tunnusta";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Vahvistamalla maksusi PayPalin kanssa valtuutat %@ veloittamaan tulevia maksuja PayPal-tililtäsi heidän ehtojensa mukaisesti.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Jatkamalla PayPaliin valtuutat %@ veloittamaan tulevia maksuja PayPal-tililtäsi heidän ehtojensa mukaisesti.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Jatkamalla hyväksyt maksujen valtuutuksen <terms>näiden ehtojen mukaisesti</terms>.";

"By continuing, you agree to authorize payments pursuant to these <terms>terms</terms>." = "Jatkamalla hyväksyt maksut näiden <terms>ehtojen</terms> mukaisesti.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Jatkamalla valtuutat kauppiaan %1$@ veloittamaan Cash App -tiliäsi tälle ja tuleville maksuille kauppiaan %2$@ ehtojen mukaisesti, kunnes tämä todennus peruutetaan. Voit muuttaa tätä milloin tahansa Cash App -asetuksista.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Liittymällä Linkiin hyväksyt <terms>ehdot</terms> ja <privacy>tietosuojaselosteen</privacy>.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Antamalla maksutiedot ja vahvistamalla tämän maksun, valtuutat (A) %@ ja Stripen, maksupalvelun tarjoajamme, lähettämään ohjeita pankillesi tilisi veloittamiseksi ja (B) pankkisi veloittamaan tiliäsi annettujen ohjeiden mukaisesti. Oikeuksiesi mukaisesti olet oikeutettu maksun palautukseen pankiltasi heidän kanssaan tekemäsi sopimuksen mukaisesti. Maksun palautus on lunastettava kahdeksan viikon kuluessa tilisi veloituksesta. Oikeutesi kerrotaan lausunnossa, jonka voit hankkia pankiltasi. Hyväksyt vastaanottamaan ilmoituksia tulevista veloituksista kaksi päivää ennen niiden tapahtumista.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Tallentamalla pankkitilisi yritykselle %@, hyväksyt maksujen valtuutuksen <terms>näiden ehtojen mukaisesti</terms>.";

"Cancel and pay another way" = "Peruuta ja maksa toisella tavalla";

"Change email" = "Vaihda sähköposti";

"Choose a payment method" = "Valitse maksutapa";

"Close card scanner" = "Sulje korttiskanneri";

"Code sent" = "Koodi lähetetty";

"Contact information" = "Yhteystiedot";

"Default" = "Oletus";

"EPS Bank" = "EPS-pankki";

"Enter address manually" = "Syötä osoite manuaalisesti";

"Enter the code sent to %@ to use Link to pay by default." = "Syötä numeroon %@ lähetetty koodi käyttääksesi Link-maksua oletuksena.";

"Enter your verification code" = "Syötä vahvistuskoodi";

"For security, please re-enter your card’s security code." = "Turvallisuussyistä sinun on annettava korttisi turvakoodi uudelleen.";

"IBAN" = "IBAN";

"Join Link" = "Liity Link-palveluun";

"Log out of Link" = "Kirjaudu ulos Link-palvelusta";

"Name on card" = "Kortissa oleva nimi";

"Not %@?" = "Ei %@?";

"Open your UPI app to approve your payment within %@" = "Avaa UPI-sovellus ja hyväksy maksu kohteessa %@";

"Or" = "Tai";

"Or pay using" = "Tai käytä maksutapaa";

"Or pay with a card" = "Tai maksa kortilla";

"Pay %@" = "Maksa %@";

"Pay another way" = "Maksa toisella tavalla";

"Pay faster at %@ and thousands of merchants." = "Maksa nopeammin palvelussa %@ ja tuhansilla muilla kauppiailla.";

"Pay in <num_installments/> interest-free payments of <installment_price/> with <img/>" = "Maksu <num_installments/> korottomassa <installment_price/> osassa maksutavalla <img/>";

"Pay later with Klarna." = "Maksa myöhemmin Klarnalla.";

"Pay over time with %@" = "Maksa aikanaan kohteella %@";

"Pay using" = "Käytä maksutapaa";

"Pay with %@" = "Maksutapa: %@";

"Pay with your bank account in just a few steps." = "Maksa pankkitiliäsi käyttäen vain muutamassa vaiheessa.";

"Payment" = "Maksu";

"Payment failed" = "Maksu epäonnistui";

"Payment methods" = "Maksutavat";

"Please go back and select another payment method" = "Palaa takaisin ja valitse toinen maksutapa";

"Point the camera at your card." = "Osoita kamera korttia kohti.";

"Processing..." = "Käsitellään...";

"Przelewy24 Bank" = "Przelewy24 Bank";

"Remove %1$@ ending in %2$@" = "Poista %1$@, joka päättyy numeroihin %2$@";

"Remove Card" = "Poista kortti";

"Remove card" = "Poista kortti";

"Remove linked account" = "Poista linkitetty tili";

"Resend code" = "Lähetä koodi uudelleen";

"Save address" = "Tallenna osoite";

"Save for future payments" = "Tallenna tulevia maksuja varten";

"Save my info for secure 1-click checkout" = "Tallenna tietoni turvalliselle yhden napsautuksen maksamiselle";

"Save this account for future %@ payments" = "Tallenna tämä tili tulevia maksuja %@ varten";

"Save this card for future %@ payments" = "Tallenna tämä kortti tulevia maksuja (%@) varten";

"Secure 1⁠-⁠click checkout" = "Turvallinen kerran napsautettava maksaminen";

"Select your payment method" = "Valitse maksutapa";

"Set as default" = "Aseta oletusarvoiseksi";

"Set as default payment method" = "Aseta oletusarvoiseksi maksutavaksi";

"Set up" = "Määritä";

"Shipping to %@ is not supported." = "Toimitusta kohteeseen %@ ei tueta.";

"Show menu" = "Näytä valikko";

"Sign in to your Link account" = "Kirjaudu sisään Link-tiliisi";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Stripe tallettaa 0,01 dollaria tilillesi 1–2 arkipäivän kuluessa. Saat myös sähköpostiisi ohjeet maksun suorittamiseksi loppuun yritykselle %@.";

"Tap to close" = "Suljet napauttamalla";

"Tap to expand" = "Laajenna napauttamalla";

"The IBAN you entered is incomplete." = "IBAN on puutteellinen.";

"The provided verification code has expired." = "Annettu vahvistuskoodi on vanhentunut.";

"The provided verification code is incorrect." = "Annettu vahvistuskoodi on virheellinen.";

"This card has expired. Update your card info or choose a different payment method." = "Tämä kortti on erääntynyt. Päivitä kortin tiedot tai valitse toinen maksutapa.";

"This is your default" = "Tämä on oletusarvoinen";

"Too many attempts. Please try again in a few minutes." = "Liian monta yritystä. Kokeile uudelleen muutaman minuutin kuluttua.";

"Unavailable for this purchase" = "Ei käytettävissä tälle ostolle";

"Update card" = "Päivitä kortti";

"Use your saved info to check out faster" = "Käytä tallennettuja tietoja nopeampaan maksamiseen";

"Your IBAN should start with a two-letter country code." = "IBAN-tilinumero alkaa kaksikirjaimisella maakoodilla.";

"iDEAL Bank" = "iDEAL-pankki";
